-- phpMyAdmin SQL Dump
-- version 3.5.5
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Apr 07, 2013 at 11:29 PM
-- Server version: 5.1.68-cll
-- PHP Version: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `kashmari_eshop`
--

DELIMITER $$
--
-- Procedures
--
CREATE DEFINER=`kashmari`@`localhost` PROCEDURE `proc_discounts_buyfloor`(IN f_id INT)
BEGIN
    SELECT * FROM `tbl_discounts`
WHERE dc_id=(SELECT dcb_dc_id FROM `tbl_discounts_buyfloor`
WHERE dcb_price< (SELECT SUM(bl_count*price) FROM `view_buy_list`
WHERE bl_f_id=f_id) 
ORDER BY dcb_price DESC
limit 0,1);
 END$$

CREATE DEFINER=`kashmari`@`localhost` PROCEDURE `proc_discounts_count`(IN f_id INT)
BEGIN
    SELECT * FROM `tbl_discounts`
WHERE dc_id=(SELECT dcc_dc_id FROM `tbl_discounts_count`
WHERE dcc_count < (SELECT SUM(bl_count) FROM `tbl_buy_list`
WHERE bl_f_id = f_id) 
ORDER BY dcc_count DESC
limit 0,1);
 END$$

CREATE DEFINER=`kashmari`@`localhost` PROCEDURE `proc_discounts_groups`(IN username varchar(50))
BEGIN

SELECT * 
		FROM  `tbl_discounts` 
		WHERE dc_id IN (		
						 SELECT dcg_dc_id
						 FROM tbl_discounts_groups
						 WHERE dcg_cg_id = ( 
											 SELECT c_cg_id 
											 FROM  `tbl_customers` 
											 WHERE c_username =  username 
											)
						)
		LIMIT 0 , 1;
   
END$$

--
-- Functions
--
CREATE DEFINER=`kashmari`@`localhost` FUNCTION `func_factor_price`(fid int(11)) RETURNS int(11)
    DETERMINISTIC
RETURN (SELECT 
IFNULL((SELECT SUM( `bl_count`*`price`) FROM `view_buy_list` WHERE `bl_f_id`=f_id),0)
FROM  `tbl_factors` 
WHERE  `f_id` =fid )$$

DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `tbl_cites`
--

CREATE TABLE IF NOT EXISTS `tbl_cites` (
  `c_id` int(11) NOT NULL AUTO_INCREMENT,
  `c_p_id` int(11) DEFAULT NULL,
  `c_title` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`c_id`),
  KEY `c_p_id` (`c_p_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=414 ;

--
-- Dumping data for table `tbl_cites`
--

INSERT INTO `tbl_cites` (`c_id`, `c_p_id`, `c_title`) VALUES
(1, 1, 'شبستر'),
(2, 1, 'عجب شير'),
(3, 1, 'مراغه'),
(4, 1, 'مرند'),
(5, 1, 'ملكان '),
(6, 1, 'ميانه '),
(7, 1, 'هريس '),
(8, 1, 'هشترود'),
(9, 1, 'ورزقان '),
(10, 2, 'اروميه '),
(11, 2, 'اشنويه '),
(12, 2, 'بوكان '),
(13, 2, 'پلدشت'),
(14, 2, 'پيرانشهر'),
(15, 2, 'تكاب '),
(16, 2, 'چالدران '),
(17, 2, 'چايپاره '),
(18, 2, 'خوي '),
(19, 2, 'سردشت '),
(20, 2, 'سلماس '),
(21, 2, 'شاهين دژ'),
(22, 2, 'شوط'),
(23, 2, 'ماكو'),
(24, 2, 'مهاباد'),
(25, 2, 'مياندوآب '),
(26, 2, 'نقده '),
(29, 3, 'اردبيل '),
(30, 3, 'بيله سوار'),
(31, 3, 'پارس آباد'),
(32, 3, 'خلخال'),
(33, 3, 'كوثر'),
(34, 3, 'گرمي '),
(35, 3, 'مشگين شهر'),
(36, 3, 'نمين '),
(37, 3, 'نير'),
(40, 4, 'آران و بيدگل'),
(41, 4, 'اردستان '),
(42, 4, 'اصفهان '),
(43, 4, 'برخوار'),
(44, 4, 'تيران و كرون '),
(45, 4, 'چادگان '),
(46, 4, 'خميني شهر'),
(47, 4, 'خوانسار'),
(48, 4, 'دهاقان'),
(49, 4, 'سميرم '),
(50, 4, 'شاهين شهر و ميمه'),
(51, 4, 'شهرضا'),
(52, 4, 'فريدن '),
(53, 4, 'فريدونشهر'),
(54, 4, 'فلاورجان '),
(55, 4, 'كاشان '),
(56, 4, 'گلپايگان '),
(57, 4, 'لنجان '),
(58, 4, 'مباركه '),
(59, 4, 'نائين '),
(60, 4, 'نجف آباد'),
(61, 4, 'نطنز'),
(64, 5, 'آبدانان '),
(65, 5, 'ايلام '),
(66, 5, 'ايوان '),
(67, 5, 'دره شهر'),
(68, 5, 'دهلران '),
(69, 5, 'شيروان وچرداول'),
(70, 5, 'ملكشاهي '),
(71, 5, 'مهران '),
(74, 6, 'بوشهر'),
(75, 6, 'تنگستان '),
(76, 6, 'جم '),
(77, 6, 'دشتستان '),
(78, 6, 'دشتي '),
(79, 6, 'دير'),
(80, 6, 'ديلم '),
(81, 6, 'كنگان '),
(82, 6, 'گناوه '),
(85, 7, 'اسلامشهر'),
(86, 7, 'پاكدشت '),
(87, 7, 'تهران '),
(88, 7, 'دماوند'),
(89, 7, 'رباط كريم '),
(90, 7, 'ري '),
(91, 7, 'ساوجبلاغ '),
(92, 7, 'شميرانات '),
(93, 7, 'شهريار'),
(94, 7, 'فيروزكوه '),
(95, 7, 'كرج '),
(96, 7, 'نظرآباد'),
(97, 7, 'ورامين '),
(100, 8, 'اردل '),
(101, 8, 'بروجن '),
(102, 8, 'شهر كرد'),
(103, 8, 'فارسان'),
(104, 8, 'كوهرنگ '),
(105, 8, 'كيار'),
(106, 8, 'لردگان '),
(109, 9, 'بشرويه '),
(110, 9, 'بيرجند'),
(111, 9, 'درميان'),
(112, 9, 'سرايان'),
(113, 9, 'سربيشه '),
(114, 9, 'فردوس '),
(115, 9, 'قائنات '),
(116, 9, 'نهبندان '),
(119, 10, 'بردسكن '),
(120, 10, 'بينالود'),
(121, 10, 'تايباد'),
(122, 10, 'تخت جلگه '),
(123, 10, 'تربت جام '),
(124, 10, 'تربت حيدريه'),
(125, 10, 'جغتاي '),
(126, 10, 'جوين'),
(127, 10, 'چناران '),
(128, 10, 'خليل آباد'),
(129, 10, 'خواف '),
(130, 10, 'درگز '),
(131, 10, 'رشتخوار'),
(132, 10, 'زاوه'),
(133, 10, 'سبزوار'),
(134, 10, 'سرخس '),
(135, 10, 'فريمان '),
(136, 10, 'قوچان '),
(137, 10, 'كاشمر'),
(138, 10, 'كلات '),
(139, 10, 'گناباد'),
(140, 10, 'مشهد'),
(141, 10, 'مه ولات'),
(142, 10, 'نيشابور'),
(145, 11, 'اسفراين '),
(146, 11, 'بجنورد'),
(147, 11, 'جاجرم '),
(148, 11, 'شيروان '),
(149, 11, 'فاروج'),
(150, 11, 'گرمه'),
(151, 11, 'مانه و سملقان'),
(154, 12, 'آبادان '),
(155, 12, 'اميديه '),
(156, 12, 'انديكا'),
(157, 12, 'انديمشك '),
(158, 12, 'اهواز'),
(159, 12, 'ايذه '),
(160, 12, 'باغ ملك '),
(161, 12, 'بندرماهشهر'),
(162, 12, 'بهبهان '),
(163, 12, 'خرمشهر'),
(164, 12, 'دزفول '),
(165, 12, 'دشت آزادگان'),
(166, 12, 'رامشير'),
(167, 12, 'رامهرمز'),
(168, 12, 'شادگان '),
(169, 12, 'شوش '),
(170, 12, 'شوشتر'),
(171, 12, 'گتوند'),
(172, 12, 'لالي '),
(173, 12, 'مسجد سليمان'),
(174, 12, 'هفتگل '),
(175, 12, 'هنديجان '),
(176, 12, 'هويزه '),
(179, 13, 'ابهر'),
(180, 13, 'ايجرود'),
(181, 13, 'خدابنده '),
(182, 13, 'خرمدره '),
(183, 13, 'زنجان '),
(184, 13, 'طارم '),
(185, 13, 'ماه نشان '),
(188, 14, 'دامغان '),
(189, 14, 'سمنان '),
(190, 14, 'شاهرود'),
(191, 14, 'گرمسار'),
(192, 14, 'مهدي شهر'),
(195, 15, 'ايرانشهر'),
(196, 15, 'چاه بهار'),
(197, 15, 'خاش '),
(198, 15, 'دلگان '),
(199, 15, 'زابل '),
(200, 15, 'زابلي '),
(201, 15, 'زاهدان '),
(202, 15, 'زهك '),
(203, 15, 'سراوان '),
(204, 15, 'سرباز'),
(205, 15, 'سيب سوران'),
(206, 15, 'كنارك'),
(207, 15, 'ميان كنگي '),
(208, 15, 'نيك شهر'),
(211, 16, 'آباده '),
(212, 16, 'ارسنجان '),
(213, 16, 'استهبان '),
(214, 16, 'اقليد'),
(215, 16, 'بوانات '),
(216, 16, 'پاسارگاد'),
(217, 16, 'جهرم '),
(218, 16, 'خرم بيد'),
(219, 16, 'خنج'),
(220, 16, 'داراب '),
(221, 16, 'رستم '),
(222, 16, 'زرين دشت'),
(223, 16, 'سپيدان '),
(224, 16, 'سروستان '),
(225, 16, 'شيراز'),
(226, 16, 'فراشبند'),
(227, 16, 'فسا'),
(228, 16, 'فيروزآباد'),
(229, 16, 'قيروكارزين'),
(230, 16, 'كازرون '),
(231, 16, 'لارستان '),
(232, 16, 'لامرد'),
(233, 16, 'مرودشت '),
(234, 16, 'ممسني '),
(235, 16, 'مهر'),
(236, 16, 'ني ريز'),
(239, 17, 'آبيك '),
(240, 17, 'البرز'),
(241, 17, 'بوئين زهرا'),
(242, 17, 'تاكستان '),
(243, 17, 'قزوين '),
(245, 18, 'قم '),
(248, 19, 'بانه '),
(249, 19, 'بيجار'),
(250, 19, 'دهگلان'),
(251, 19, 'ديواندره '),
(252, 19, 'سروآباد'),
(253, 19, 'سقز'),
(254, 19, 'سنندج '),
(255, 19, 'قروه '),
(256, 19, 'كامياران '),
(257, 19, 'مريوان '),
(260, 20, 'بافت '),
(261, 20, 'بردسير'),
(262, 20, 'بم '),
(263, 20, 'جيرفت '),
(264, 20, 'راور'),
(265, 20, 'رفسنجان '),
(266, 20, 'رودبار جنوب'),
(267, 20, 'ريگان '),
(268, 20, 'زرند'),
(269, 20, 'سيرجان '),
(270, 20, 'شهربابك '),
(271, 20, 'عنبرآباد'),
(272, 20, 'قلعه گنج '),
(273, 20, 'كرمان '),
(274, 20, 'كهنوج '),
(275, 20, 'كوهبنان'),
(276, 20, 'منوجان '),
(279, 21, 'اسلام آباد غرب'),
(280, 21, 'پاوه '),
(281, 21, 'ثلاث باباجاني '),
(282, 21, 'جوانرود'),
(283, 21, 'دالاهو'),
(284, 21, 'روانسر'),
(285, 21, 'سر پل ذهاب '),
(286, 21, 'سنقر'),
(287, 21, 'صحنه '),
(288, 21, 'قصر شيرين '),
(289, 21, 'كرمانشاه '),
(290, 21, 'كنگاور'),
(291, 21, 'گيلانغرب '),
(292, 21, 'هرسين '),
(295, 22, 'بهمئي '),
(296, 22, 'بويراحمد'),
(297, 22, 'دنا'),
(298, 22, 'كهگيلويه '),
(299, 22, 'گچساران '),
(302, 23, 'آزادشهر'),
(303, 23, 'آق قلا'),
(304, 23, 'بندر گز'),
(305, 23, 'تركمن '),
(306, 23, 'راميان '),
(307, 23, 'علي آباد'),
(308, 23, 'كرد كوي '),
(309, 23, 'كلاله '),
(310, 23, 'گرگان '),
(311, 23, 'گنبد كاووس'),
(312, 23, 'مراوه تپه '),
(313, 23, 'مينودشت '),
(316, 24, 'آستارا'),
(317, 24, 'آستانه اشرفيه'),
(318, 24, 'املش '),
(319, 24, 'بندر انزلي '),
(320, 24, 'رشت '),
(321, 24, 'رضوانشهر'),
(322, 24, 'رودبار'),
(323, 24, 'رودسر'),
(324, 24, 'سياهكل '),
(325, 24, 'شفت '),
(326, 24, 'صومعه سرا'),
(327, 24, 'طوالش '),
(328, 24, 'فومن '),
(329, 24, 'لاهيجان'),
(330, 24, 'لنگرود'),
(331, 24, 'ماسال '),
(334, 25, 'ازنا'),
(335, 25, 'اليگودرز'),
(336, 25, 'بروجرد'),
(337, 25, 'پلدختر'),
(338, 25, 'خرم آباد'),
(339, 25, 'دلفان '),
(340, 25, 'دورود'),
(341, 25, 'سلسله '),
(342, 25, 'كوهدشت '),
(345, 26, 'آمل '),
(346, 26, 'بابل '),
(347, 26, 'بابلسر'),
(348, 26, 'بهشهر'),
(349, 26, 'تنكابن '),
(350, 26, 'جويبار'),
(351, 26, 'چالوس '),
(352, 26, 'رامسر'),
(353, 26, 'ساري '),
(354, 26, 'سواد كوه '),
(355, 26, 'فريدونكنار'),
(356, 26, 'قائم شهر'),
(357, 26, 'گلوگاه'),
(358, 26, 'محمود آباد'),
(359, 26, 'نكا'),
(360, 26, 'نور'),
(361, 26, 'نوشهر'),
(364, 27, 'آشتيان '),
(365, 27, 'اراك '),
(366, 27, 'تفرش '),
(367, 27, 'خمين '),
(368, 27, 'خنداب'),
(369, 27, 'دليجان '),
(370, 27, 'زرنديه '),
(371, 27, 'ساوه '),
(372, 27, 'شازند'),
(373, 27, 'كميجان '),
(374, 27, 'محلات '),
(377, 28, 'ابوموسي '),
(378, 28, 'بستك '),
(379, 28, 'بندر لنگه '),
(380, 28, 'بندرعباس '),
(381, 28, 'پارسيان'),
(382, 28, 'جاسك '),
(383, 28, 'حاجي آباد'),
(384, 28, 'خمير'),
(385, 28, 'رودان '),
(386, 28, 'سيريك'),
(387, 28, 'قشم '),
(388, 28, 'ميناب '),
(391, 29, 'اسدآباد'),
(392, 29, 'بهار'),
(393, 29, 'تويسركان '),
(394, 29, 'رزن '),
(395, 29, 'كبودرآهنگ'),
(396, 29, 'ملاير'),
(397, 29, 'نهاوند'),
(398, 29, 'همدان '),
(401, 30, 'ابركوه '),
(402, 30, 'اردكان '),
(403, 30, 'بافق '),
(404, 30, 'تفت'),
(405, 30, 'خاتم '),
(406, 30, 'صدوق '),
(407, 30, 'طبس '),
(408, 30, 'مهريز'),
(409, 30, 'ميبد'),
(410, 30, 'يزد'),
(412, 43, 'بیروت'),
(413, 4, 'ggg');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_provinces`
--

CREATE TABLE IF NOT EXISTS `tbl_provinces` (
  `p_id` int(11) NOT NULL AUTO_INCREMENT,
  `p_title` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`p_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=44 ;

--
-- Dumping data for table `tbl_provinces`
--

INSERT INTO `tbl_provinces` (`p_id`, `p_title`) VALUES
(1, 'آذربايجان شرقي'),
(2, 'آذربايجان غربي'),
(3, 'اردبيل'),
(4, 'اصفهان'),
(5, 'ايلام'),
(6, 'بوشهر'),
(7, 'تهران'),
(8, 'چهارمحال وبختياري'),
(9, 'خراسان جنوبي'),
(10, 'خراسان رضوي'),
(11, 'خراسان شمالي'),
(12, 'خوزستان'),
(13, 'زنجان'),
(14, 'سمنان'),
(15, 'سيستان وبلوچستان'),
(16, 'فارس'),
(17, 'قزوين'),
(18, 'قم '),
(19, 'كردستان'),
(20, 'كرمان'),
(21, 'كرمانشاه'),
(22, 'كهگيلويه وبويراحمد'),
(23, 'گلستان'),
(24, 'گيلان'),
(25, 'لرستان'),
(26, 'مازندران'),
(27, 'مركزي'),
(28, 'هرمزگان'),
(29, 'همدان'),
(30, 'يزد'),
(43, 'لبنان');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
